steps:
* Terminal Commands
    * pip install pandas(for anaconda: conda install numpy )
    * python -m pip install ipykernel(for conda : conda install ipykernel)
* for jupyter notebook:
    * its preinstalled in conda base env.
    * for normal installation use "pip install notebook"

# Pandas Series

In [1]:
import pandas as pd
import numpy as np

In [2]:
#srating by creating labels
labels = ['a','b','c']
#data
my_data = [10,20,30]
#now transforming that data into numpy array
arr = np.array(my_data)
#we can also create a dictionary
#which contains labels as the keys and data as the values
d = {'a':10,'b':20,'c':30}

In [3]:
#Creating a Pandas series
pd.Series(data=my_data)
#Series is a one dimensional array
#similar to a column in a table
#here the index is numbers

0    10
1    20
2    30
dtype: int64

In [4]:
#series with index as labels
pd.Series(data=my_data,index=labels)
#here the data is a list

a    10
b    20
c    30
dtype: int64

In [6]:
#we can also create a series from a numpy array
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [7]:
#we can also create a series from a dictionary
pd.Series(d)
#here the keys are the labels and the values are the data

a    10
b    20
c    30
dtype: int64

In [8]:
#we can add different types of object to a series
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [9]:
#here we can add built in finctions
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [13]:
#making 2 new series
series1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])
series2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [14]:
#grabing data from series
series1['USA']
#this works as grabing data from a dictionary

1

In [15]:
#addition of series
series1 + series2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# DATA FRAMES

In [16]:
#importing numpy and pandas and randn
import numpy as np
import pandas as pd
from numpy.random import randn

In [17]:
#seeding makes the random numbers predictable and follows the same pattern
np.random.seed(101)

In [20]:
#start by creating a dataframe
df = pd.DataFrame(data=randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [21]:
#grabbing the y column
df['Y']

A   -1.706086
B    0.166905
C    0.638787
D   -0.943406
E    0.238127
Name: Y, dtype: float64

In [22]:
#checking the type of data['Y']
type(df['Y'])

pandas.core.series.Series

In [24]:
#grabbing multiple columns
df[['Y','Z']]

          Y         Z
A -1.706086 -1.159119
B  0.166905  0.184502
C  0.638787  0.329646
D -0.943406  0.484752
E  0.238127  1.996652

In [32]:
#creating a new column
df['new'] = df['Y'] + df['Z']

In [27]:
df.drop('new',axis=1,)
#deleting a column
#axis = 1 because we are deleting a column not a row
#the axis is set to 0 by default which denotes rows

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [29]:
#but there is no change in the dataframe permetently
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -2.865205
B -0.134841  0.390528  0.166905  0.184502  0.351406
C  0.807706  0.072960  0.638787  0.329646  0.968433
D -0.497104 -0.754070 -0.943406  0.484752 -0.458655
E -0.116773  1.901755  0.238127  1.996652  2.234779

In [33]:
#delet a column permanently
del df['new']
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [34]:
#or we can also delete by adding inplace=True
df.drop('Z',axis=1,inplace=True)

In [35]:
#we can also drop rows
df.drop('A',axis=0)
#axis is 0 by default which denotes rows

          W         X         Y
B -0.134841  0.390528  0.166905
C  0.807706  0.072960  0.638787
D -0.497104 -0.754070 -0.943406
E -0.116773  1.901755  0.238127

In [36]:
#and again if we run df
df

          W         X         Y
A  0.302665  1.693723 -1.706086
B -0.134841  0.390528  0.166905
C  0.807706  0.072960  0.638787
D -0.497104 -0.754070 -0.943406
E -0.116773  1.901755  0.238127

In [37]:
#so we have to add inplace=True
df.drop('A',axis=0,inplace=True)

In [38]:
df

          W         X         Y
B -0.134841  0.390528  0.166905
C  0.807706  0.072960  0.638787
D -0.497104 -0.754070 -0.943406
E -0.116773  1.901755  0.238127

In [39]:
#now you might think why axis 0 is rows and axis 1 is columns
#we can figure that out but finding the shape of the dataframe
df.shape

(4, 3)

* as deleting the rows and columns in previous lines we get a 4 rows and 3 columns <br>
* so when we are using shape we get a tuple of 4 and 3 where index 0 is 4 and index 1 is 3 <br>
* so pandas is smart enough to figure out the shape of the dataframe and <br>
* axis 0 is rows and axis 1 is columns

In [40]:
#making the dataframe again
df = pd.DataFrame(data=randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [41]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [43]:
#grabing rows
df.loc['A']

W   -0.993263
X    0.196800
Y   -1.136645
Z    0.000366
Name: A, dtype: float64

In [44]:
#index based locations
df.iloc[1]

W    1.025984
X   -0.156598
Y   -0.031579
Z    0.649826
Name: B, dtype: float64

In [45]:
#grabing a single element
df.iloc[1,1]
#or 
df.loc['A','Y']

-0.1565979042889875

In [47]:
#grabing multiple elements
df.loc[['A','B'],['Y','Z']]
#or with iloc
df.iloc[[0,1],[2,3]]

          Y         Z
A -1.136645  0.000366
B -0.031579  0.649826